In [ ]:
#Basic Math Operations
-Difference
-Rolling Meam
-Diff()

In [195]:
import pandas as pd
from pandas import Series, DataFrame

In [137]:
df = pd.read_csv('C:\Users\omc\Desktop\Machine-Learning-prerequisites\PopulationProjection2016.csv',index_col='State')

In [138]:
type(df)

pandas.core.frame.DataFrame

In [139]:
df.head()

,Unnamed: 0,Male,Female,Total,Male .1,Female .1,Total.1
State,,,,,,,
Andaman & Nicobar Islands,0,17547,17768,35315,11034,11198,22232
Andhra Pradesh,1,2165879,2032435,4198320,1309000,1229445,2538440
Arunachal Pradesh,2,88695,85828,174523,39439,38352,77791
Assam,3,1792270,1714270,3506540,944482,894428,1838910
Bihar,4,7834139,7183699,15017838,3654434,3076180,6730614

In [143]:
del df['Unnamed: 0']

In [146]:
del df['Male .1']

In [147]:
del df['Female .1']

In [148]:
del df['Total.1']

In [149]:
df.head()

                             Male   Female      Total
State
Andaman & Nicobar Islands    17547    17768     35315
Andhra Pradesh             2165879  2032435   4198320
Arunachal Pradesh            88695    85828    174523
Assam                      1792270  1714270   3506540
Bihar                      7834139  7183699  15017838

In [171]:
df1 = df.rename(columns={'Male ':'MALE','Female ':'FEMALE'})

In [172]:
df1.head()

                              MALE   FEMALE     Total
State
Andaman & Nicobar Islands    17547    17768     35315
Andhra Pradesh             2165879  2032435   4198320
Arunachal Pradesh            88695    85828    174523
Assam                      1792270  1714270   3506540
Bihar                      7834139  7183699  15017838

In [176]:
df1['Diff']=df1['MALE'] - df1.FEMALE

In [179]:
df1.head()

                              MALE   FEMALE     Total    Diff
State
Andaman & Nicobar Islands    17547    17768     35315    -221
Andhra Pradesh             2165879  2032435   4198320  133444
Arunachal Pradesh            88695    85828    174523    2867
Assam                      1792270  1714270   3506540   78000
Bihar                      7834139  7183699  15017838  650440

In [199]:
df1['Mean'] = Series.rolling(df1['MALE'],window=2,center=False).mean()

In [202]:
df1.head()

                              MALE   FEMALE     Total    Diff       Mean
State
Andaman & Nicobar Islands    17547    17768     35315    -221        NaN
Andhra Pradesh             2165879  2032435   4198320  133444  1091713.0
Arunachal Pradesh            88695    85828    174523    2867  1127287.0
Assam                      1792270  1714270   3506540   78000   940482.5
Bihar                      7834139  7183699  15017838  650440  4813204.5

In [204]:
df1['Male-Diff/yr'] = df1['MALE'].diff()

In [205]:
df1.head()

,MALE,FEMALE,Total,Diff,Mean,Male-Diff/yr
State,,,,,,
Andaman & Nicobar Islands,17547,17768,35315,-221,NaN,NaN
Andhra Pradesh,2165879,2032435,4198320,133444,1091713.0,2148332.0
Arunachal Pradesh,88695,85828,174523,2867,1127287.0,-2077184.0
Assam,1792270,1714270,3506540,78000,940482.5,1703575.0
Bihar,7834139,7183699,15017838,650440,4813204.5,6041869.0